app/mailers/user_mailer.rb

SELECT "users"."email" FROM "users" WHERE "users"."account_type" = $1  [["account_type", "Admin"]]
---
    def coinsLow(coin)
        #set @coin to coin
        @coin = coin
        #sql below to grab all admins then send mail to all admins array
        @admins = User.where(account_type: "Admin").pluck(:email)