app/controllers/application_controller.rb

    def current_user
        return nil unless params[:api_key]
        @current_user ||= User.find_by(api_key: params[:api_key])
---
SELECT  "users".* FROM "users" WHERE "users"."api_key" = $1 LIMIT $2  [["api_key", "2GHbScsJsb7F4zZjTrp5jQ=="], ["LIMIT", 1]]