app/controllers/coins_controller.rb

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
---
    def show
        #shows a coin if it exists by it's id, else lets end know it's a bad request!


        @coin = Coin.find_by(id: params[:id])

INSERT INTO "coins" ("name", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["value", 99], ["created_at", "2020-03-23 19:32:57.456994"], ["updated_at", "2020-03-23 19:32:57.456994"]]
---
    def create
        #to initialy create a coin that doesnt exist if coin susccessfully saves then render ok else bad request

        @coin = Coin.new(coin_params)

        if @coin.save

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 9]]
---
    def destroy
        # if coin exists by id destroy it else bad request
        @coin = Coin.find_by(id: params[:id])

        if @coin #checking to see if coin exists (is it nil?)
            @coin.destroy #DESTROY!

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "coins" SET "name" = $1, "value" = $2, "updated_at" = $3 WHERE "coins"."id" = $4  [["name", "supertest"], ["value", 200], ["updated_at", "2020-03-23 19:42:36.283845"], ["id", 10]]
---
    def update
        #updates the coin
            @coin = Coin.find_by(id: params[:id]) #finds by coin_params

            @coin.update(coin_params) #update