app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
    def index
        #show all transactions!
        @transactions = Transaction.all

INSERT INTO "transactions" ("coin_id", "created_at", "updated_at", "user_id", "transaction_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["coin_id", 1], ["created_at", "2020-03-23 19:53:20.179658"], ["updated_at", "2020-03-23 19:53:20.179658"], ["user_id", 1], ["transaction_type", "Withdrawal"]]
---
    def create
            #create a new transaction
        @transaction = Transaction.new(transaction_params)

        if @transaction.save

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #shows transaction by the id of he transaction
        @transaction = Transaction.find_by(id: params[:id])

SELECT "transactions".* FROM "transactions" WHERE "transactions"."transaction_type" = $1  [["transaction_type", "withdrawal"]]
---
    def withdrawals
        #show a list of withdrawals

        @withdrawals = Transaction.where(transaction_type: 'withdrawal')

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("coin_id", "created_at", "updated_at", "user_id", "transaction_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["coin_id", 1], ["created_at", "2020-03-24 01:15:36.226793"], ["updated_at", "2020-03-24 01:15:36.226793"], ["user_id", 1], ["transaction_type", "withdrawal"]]
---
     def withdraw
        #subtract coin from count
        @coin = Coin.find_by(id: params[:coin_id])
        @user = User.find_by(id: params[:transaction][:user_id])

        if @coin.count > 0
            @coin.minusCoin

            # if count is getting lower than 5 send admins email!
            mail_admins = UserMailer.coinsLow(@coin).deliver_now if @coin.count < 5


            #track transaction by initiating new Transaction instance
            @transaction = Transaction.new(user_id: @user.id, coin_id: @coin.id, transaction_type: "withdrawal")

            #save it
            @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."transaction_type" = $1  [["transaction_type", "deposit"]]
---
    def deposits
        #show a list of deposits
        @deposits = Transaction.where(transaction_type: 'deposit')

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("coin_id", "created_at", "updated_at", "user_id", "transaction_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["coin_id", 3], ["created_at", "2020-03-24 00:03:25.653945"], ["updated_at", "2020-03-24 00:03:25.653945"], ["user_id", 1], ["transaction_type", "Deposit"]]
---
    def deposit
        #find a coin by its id

        @coin = Coin.find_by(id: params[:coin_id])
        @user = User.find_by(id: params[:transaction][:user_id])

        @coin.refillCoin #call refillCoin to +1 the save will happen in refillCoin

         #track transaction by initiating new Transaction instance

            @transaction = Transaction.new(coin_id: @coin.id, user_id: @user.id, transaction_type: 'deposit')

            #save it
            @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
---
    def userTransactions
        #check all transactions by current user
        @transactions = Transaction.where(user_id: params[:user_id])

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def transactionTime?
        #shows what time a transaction happned
        @transaction = Transaction.find_by(id: params[:id])