app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]
---
    def index
        @users= User.all

INSERT INTO "users" ("api_key", "created_at", "updated_at", "email", "password_digest", "account_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params) #create new user with params

           if @user.save #save it!