app/models/coin.rb

    def total
         #grabbing count and value in subarrays
            coin_count = Coin.pluck(:count, :value)
            sum = 0
            #going through each subarray (now an array) and multiplying count by value and adding to sum above
            coin_count.each{|arr| sum += arr[0] * arr[1]}
---
SELECT "coins"."count", "coins"."value" FROM "coins"
SELECT "coins"."value" FROM "coins"

    def minusCoin
        # subtract count by 1
        self.count = self.count - 1
        self.save # save it
---
UPDATE "coins" SET "count" = $1, "updated_at" = $2 WHERE "coins"."id" = $3  [["count", 4], ["updated_at", "2020-03-23 05:27:14.549903"], ["id", 3]]

    def refillCoin
        #refilling low quantity
         self.count = self.count + 1
         self.save #save it
---
UPDATE "coins" SET "count" = $1, "updated_at" = $2 WHERE "coins"."id" = $3  [["count", -3], ["updated_at", "2020-03-23 06:30:38.352022"], ["id", 3]]