app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."api_key" = $1 AND "users"."email" = $2 LIMIT $3  [["api_key", "VUpRGP5EuXAXcKjGE/gonA=="], ["email", "syedm199343@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password, key)
    #finds user by api_key and email
        @user = User.find_by(api_key: key, email: email)